const n=`# 日本の数学者 関孝和

## 導入

「和算の大家関孝和」群馬県では誰もが知っている"上毛かるた”の「わ」に彼の句が詠われていますが、関孝和 (たかかず/こうわ) については詳細を知る資料が余りにも少ないのが現状です。出生年は不明、没年は1708年です。

生涯の大半を甲府藩主に勘定専門の役人として仕え、晩年になって、藩主が5代将軍徳川綱吉の後継となったことから身分は幕臣となりましたが、間もなく隠居しました。彼についての公的な生活は上記のこと以外あまり知られていません。

和算という日本独自の数学を修めた天才で、後世では松尾芭蕉(俳聖)、千利休(茶聖)とともに「算聖」と称され、同時代に活躍したイギリスのニュートン、ドイツのライプニッツとともに世界三大数学者の一人にも数えられる日本の数学史上最高の人物とされています。

## 関孝和の主な研究と功績

- **円周率の計算**
  孝和は暦を作る過程で円周率が必要になったため、正131,072角形（ほとんど円!?）の図形を使って辺の長さを計算し、近似値を割り出し、円周率を小数点以下11桁まで正確に求める方法を確立しました。

- **行列式の発見**
  連立方程式の解を求める公式をつくる過程で発見した行列式は、ヨーロッパに先駆ける発見でした。

- **n次方程式の近似的な解の考案**
- **ベルヌーイ数（分数の級数）の発見**
- **円理（円に関する計算）の創始**

これらは当時のヨーロッパの研究水準と遜色ないものだったと言われています。

## 関孝和と和算流派

関は人柄も良かったのか？彼のもとには多くの優秀な弟子が集い、彼の教えを学び広げていったとされています。和算には多くの流派がありますが、その大部分は関の流れを汲むそうで・・・私も彼のもとで学びたかったなぁ・・・そんな思いを抱きました。

## まとめ

皆さんも興味があれば日本の数学者について調べてみてください!!!
`;export{n as default};
//# sourceMappingURL=11-BBZ9bMtI.js.map
