const n=`# 数学的には何進法が適しているのか

## 10進法への疑問

みなさんは、10進法はすきですか?ぼくはそこまで好きではありません。なぜなら、1年が１２月であったり、1バイトは８ビットであったり、なにかとキリを悪く感じることが多いからです。そもそも10進法は両手の指の数が由来とされています。ですが例外もありなんと、ニューギニアのオプサプミン族は27進数を使っているというのです。ですがそれは、人間の都合であり数学的には理にかなった数え方とは言えません。

## 数学的に理にかなった進法は？

では何進数が最も数学的に理にかなっている数え方なのでしょうか？
ここでは、よくあげられる１２進数と16進数についてみていこうと思います。

## 12進数

### 12進数の利点

1. 約数が $1, 2, 3, 4, 6, 12$ と多く分割計算がしやすい。
2. 月の満ち欠けの周期や昼と夜を12分割するなど自然サイクルと結びついている。
3. 一分は60秒、一日は24時間、一年は12か月など時間の計測に便利。
4. 12はダース、1フィートは12インチなど生活に浸透している。

### 12進数のデメリット

1. $2^n$ でないのでコンピューターとの相性が悪い。
2. 人間は10本指なので文化的に定着しにくい。
3. 円周率や12進数バージョンの九九などを覚え直さなければならない。

## 16進数

### 16進数の利点

1. $2^4$ なのでコンピューターとの相性がいい。
2. 図形や周期を分解するときに対照的に規則的に分けられる。
3. 大きな数を短くかける。

### 16進数のデメリット

1. $0$～$9$, $A$～$F$など記号の追加が多く直観的でない。
2. 人間は10本指なので文化的に定着しにくい。
3. 円周率や16進数バージョンの九九などを覚え直さなければならない。

## 比較

- 日常生活・社会制度を考えるなら12進数のほうが【人間にやさしい】
- コンピューター・工学の分野を考えるなら16進数のほうが【技術的に効率的】
- だが、どちらも既存のシステムや教育を変えるにはコストが高すぎる。

## まとめ

以上のことから、人間にとって理解しやすく扱いやすいのは12進数、技術やコンピューターについて考えるなら16進数のほうが適しており、どちらも一長一短であることがわかります。ですが、10進法で使われている公式や既存のシステムが使えなくなるということを考えると、進法を変えるのは現実的ではないということがわかります。

だったらもし、最初から人間の指が12本だったり、16本だったりしたら、12進数や16進数を使って、今よりも文明を発達させることができたのでしょうか？それは、実際には分かりませんが、12進法や16進法の世界ではどんな文明が発達していて、どんな公式が発見されるのかを考えてみるのもロマンがあっていいかもしれません。

## ☆おまけ もし12進数や16進数が使われていたら

### 九九

12進数の九九

![12進数の九九が表に記載されている](magazine/13-1.webp)

16進数の九九

![16進数の九九が表に記載されている](magazine/13-2.webp)

### 円周率

- 12進数: 3.18480943B...
- 16進数: 3.243F6A8885A3...

### アボガドロ定数

- 12進数: $1.8861 \\times 10^{17}$
- 16進数: $8.DE57A \\times 10^{17}$
`;export{n as default};
//# sourceMappingURL=13-CI7VLQmE.js.map
